/**
 * 不用加减乘除做加法
 * 思路：
 * 1. 异或运算相当于做加法，不计算进位
 * 2. 与运算相当于求进位。a+b=循环求本位+进位的值，直到不再产生进位。
 * 例如：
 * 首先看十进制是如何做的： 5+7=12，三步走
 * 第一步：相加各位的值，不算进位，得到2。
 * 第二步：计算进位值，得到10. 如果这一步的进位值为0，那么第一步得到的值就是最终结果。
 * 第三步：重复上述两步，只是相加的值变成上述两步的得到的结果2和10，得到12。
 * 同样我们可以用三步走的方式计算二进制值相加： 5-101，7-111
 * 第一步：相加各位的值，不算进位，得到010，二进制每位相加就相当于各位做异或操作，101^111。
 * 第二步：计算进位值，得到1010，相当于各位做与操作得到101，再向左移一位得到1010，(101&111)<<1。
 * 第三步重复上述两步， 各位相加 010^1010=1000，进位值为100=(010&1010)<<1。
 * 继续重复上述两步：1000^100 = 1100，进位值为0，跳出循环，1100为最终结果。
 */
public class AddTwoNumbers {
    public static int getAddSum(int num1,int num2){
        int sum=0;
        int carry=0;
        while (num2!=0){
            sum=num1^num2;
            carry=(num1&num2)<<1;
            num1=sum;
            num2=carry;
        }
        return num1;
    }

    public static void main(String[] args) {
        System.out.println(getAddSum(17,5));
    }
}
